In [1]:
import pandas as pd

In [3]:
pd.read_json("row_format.jsonl", lines=True)

     model   type  price
0  Corolla  Sedan  22000
1     RAV4    SUV  28000
2    Camry  Sedan  26000

In [4]:
df = pd.read_json("row_format.jsonl", lines=True)

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.columns

Index(['model', 'type', 'price'], dtype='object')

In [7]:
df[["model", "price"]]

     model  price
0  Corolla  22000
1     RAV4  28000
2    Camry  26000

In [11]:
pd.read_json("column_format.json")

     model   type  price
0  Corolla  Sedan  22000
1     RAV4    SUV  28000
2    Camry  Sedan  26000

In [13]:
df

     model   type  price
0  Corolla  Sedan  22000
1     RAV4    SUV  28000
2    Camry  Sedan  26000

In [14]:
df.to_dict()

{'model': {0: 'Corolla', 1: 'RAV4', 2: 'Camry'},
 'type': {0: 'Sedan', 1: 'SUV', 2: 'Sedan'},
 'price': {0: 22000, 1: 28000, 2: 26000}}

In [16]:
df.to_dict(orient="records")

[{'model': 'Corolla', 'type': 'Sedan', 'price': 22000},
 {'model': 'RAV4', 'type': 'SUV', 'price': 28000},
 {'model': 'Camry', 'type': 'Sedan', 'price': 26000}]